import { useTranslation } from "react-i18next";

import "components/About/InfoAboutBouquet/infoBouquet.scss";

export default function InfoAboutBouquet() {
  const { t } = useTranslation();

  return (
    <div className="info-bouquet">
      <div className="info-bouquet__content">
        <p className="info-bouquet__title">{t("infoBouquet.title")}</p>
        <p
          className="info-bouquet__text"
          dangerouslySetInnerHTML={{
            __html: `
      Букет з рожевої гілкової троянди. На зображенні показаний середній варіант. <br/><br/>
      Життя квітів – це мить. Це яскравий кольоровий спалах, швидкий, як спалах блискавки. Він вміщає в собі все життя квітки. В кожної квітки цей спалах особливий, тому що особливими є колір і форма кожної квітки. В кожній з наших робіт ми намагаємось вловити цю неповторність, підкреслити її і дозволити квітам розкритись та показати в повній мірі те, що вони можуть показати. <br/><br/>
      Замовити квіти на нашому сайті дуже просто. Ви можете замовити вже готову роботу із наданих нами у цьому каталозі або зателефонувати чи написати нам. Ми створимо букет за власним дизайном або втілимо в життя Ваш. <br/><br/>
      У випадку, якщо деяких квітів для цього букету не бути в наявності, ми залишаємо за собою право замінити їх на альтернативні, зберігаючи при цьому кольорову гаму, форму, стиль та цінову категорію букету. <br/><br/>
      Телефон служби доставки квітів LYSTVA в м. Львів +38 (068) 615 50 40. Доставка квітів в м. Львів працює ЦІЛОДОБОВО. Ви також можете зв’язатись з нами в мессенджері по вказаному номеру. З інформацією стосовно умов роботи служби доставки квітів Ви можете ознайомитись в пункті меню Інформація в верхній частині сторінки.
    `,
          }}
        ></p>
      </div>
      <div className="info-bouquet__line"></div>
    </div>
  );
}
